



//? زمانی که روی دکمه فرم کلیک شد

//? 1 => ولیدیشن فیلد ها با جی اس برسی بشه در صورت وجود ارور اینپوت باکس
//? به رنگ قرمز دربیاد و تکست قبلی رو هم قرمز کنه
//? و اونایی که درست بودن اینپوتشون سبز بشه

//? 2 => در صورت درست بودن همچی ولیو هایی انیپوت داخل تگ های مرتبط خودشون
//? جایگذاری میشن یعنی چی ؟ یعنی اینکه اینپوت شماره باید تو تگ خودش
//? بشینه

//? 3 => بعد از اینکه کارت جدید ساخته شد کد اچ تی ام الش
//? فرم ما باید به حالت اول برگرده و مقدار هاش خالی بشه


//! نکته اول اینکه چجوری مقدار اینپوت فایل رو بریزیم داخل تگ ایمیج

//! نکته دوم اگر سایت رفرش بشه اطلاعات عکس میپره استفاده از لوکال استوریج
//! برای ذخیره کارت ها

//! پیرو نکته قبلی نیاز هست که ایتم هایی که تو لوکال استوریج اد کرده بودی
//! رو بخونی و توی یه ابجکت پر کنی

//! بعد از پر کردن تو ابجکت با حلقه بخونی و کارت اد کنی که بعد از رفرش
//! با همین روند بتونی کار رو ببری جلو و کارت هات اد بشه

//Todo => استایل های فرم درست بشه
//Todo => استایل های کارت درست بشه
//Todo => انیمیشن های هاور به کلیه جا ها داده بشه
//Todo => فرم باید هر اینپوتش یه دیسکریپشن جدا داشته باشه

//* ادامه روند تسک

//* بعد از کلیک رو دکمه خرید فرم از موجودی اون کارت باید کم شه
//* به طوری که تو لوکال استوریج موجودی اون کارت کم شه بعد از رفرش 
//* اگر موجودی 2 بود 1 بیاد و اگر دوباره کارت جدید اد شد به موجودی اضافه شه

//! نکته = موجودی هر محصول از فرم نمیاد با هر بار اد شد به موجودی یک واحد 
//! اضافه میشه و با خرید از اون یه واحد کم میشه



//* هر بار که ایتم از فرم اد میشه تایم اضافه شدن اون ایتم تو لوکال استوریج
//* باید بیفته این تایم نمایش داده نمیشه ولی باید تو دیتابیس و ابجکتت
//* اورده بشه

//! مطلب قبلی سر اینه که تو ادامه روند تسک بتونیم فیلتر رو اعمال کنیم










